// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.

// 0, 7, 8, -2, -2 -> 2

// 1, -7, 567, 89, 223-> 3



// Console.WriteLine($"Кол-во элементов > 0: {count}");

// Console.Write("Введите количество чисел(через пробел): ");
// int[] m = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
// int count = 0;
 
// for (int i = 0; i < m.Length; i++)
// {
//     if (m[i] > 0)
//     {
//         count++;
//     }
// }
 
// Console.WriteLine($"Количество элементов > 0: {count}");

// Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.

// b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)


// double k1 = 5; 
// double b1 = 2;
// double k2 = 9;
// double b2 = 4;
 
 
// double x = -(b1 - b2) / (k1 - k2);//-0,5 - ответ
// double y = k1 * x + b1;//-0,5 - ответ
 

 
// Console.WriteLine($"Пересечение в точке: ({x};{y})");
